{"conv_num": 3, "fc_num": 2, "epochs": 50, "dropout_fc": 0.2, "dropout_conv": 0.2, "batch_normalization": true, "image_augmentation": false, "width_shift_range": 0.0, "height_shift_range": 0.0, "shear_range": 0.0, "zoom_range": 0.0, "horizontal_flip": false, "rotation_range": 0, "brightness_range": null, "zca_whitening": false, "hist": {"val_loss": [3.084373293685913, 2.4205512924194337, 2.3371308921813965, 2.366146997833252, 2.0499425579071047, 1.8245838466644286, 1.477924179649353, 1.61801258392334, 1.3602754495620728, 1.4696332109451293, 1.4013764149665833, 1.2255419402122498, 1.18601138381958, 1.0511083397865295, 0.955946258354187, 1.1149046518325805, 0.9679739284515381, 0.9000736546516418, 0.8666839179039001, 0.7602596970558166, 0.838786570072174, 0.7370387278556824, 0.7307341417312622, 0.7845288105010987, 0.6697089491844177, 0.7013667239189147, 0.7722743169784546, 0.681430476975441, 0.6838762481212616, 0.713269571018219, 0.6763791810512543, 0.6558026145935059, 0.7964027841567993, 0.6034923344612122, 0.707970189857483, 0.6943487025737762, 0.7051559036254883, 0.6277875729560852, 0.5625818578720093, 0.6425158573627472, 0.6583284954547882, 0.6429332776069641, 0.6386237979412079, 0.6313673808097839, 0.6114429720878601, 0.5167682623624802, 0.6019472883701324, 0.5659870638847351, 0.5664806948184967, 0.5496432333469391], "val_acc": [0.1498, 0.2034, 0.1834, 0.2088, 0.2924, 0.3478, 0.474, 0.4262, 0.5224, 0.4932, 0.5118, 0.5834, 0.5868, 0.6416, 0.6706, 0.607, 0.6712, 0.699, 0.7004, 0.7468, 0.7158, 0.7488, 0.7572, 0.735, 0.771, 0.7612, 0.7548, 0.7726, 0.7738, 0.7664, 0.7798, 0.7936, 0.7616, 0.7968, 0.7754, 0.7844, 0.7794, 0.8006, 0.8166, 0.796, 0.7804, 0.7884, 0.8016, 0.8096, 0.8098, 0.8272, 0.818, 0.8218, 0.8194, 0.8232], "loss": [2.15916084912618, 1.8068501237657335, 1.6631735027313233, 1.54113634062873, 1.4392149759080675, 1.351363713476393, 1.2729378389146593, 1.1941162381278143, 1.1299183878156873, 1.0665637326982287, 1.019568533431159, 0.9777232821888394, 0.9311490724563599, 0.8979539441108704, 0.8588341064241197, 0.838612616581387, 0.800026215977139, 0.7813610782623291, 0.7606847424507142, 0.7425009705437554, 0.7219585312737359, 0.6991635755750868, 0.6852230323049757, 0.6669755123456319, 0.6542298889478048, 0.6343104815483094, 0.6198162452167935, 0.6067663948906793, 0.5966620203230116, 0.5792034468015035, 0.5714134734365676, 0.5567833969434103, 0.5433409536043803, 0.5574135104629728, 0.5341222777472602, 0.5219692436748081, 0.514169260872735, 0.49405587525897554, 0.4929731073326535, 0.4810544710530175, 0.4726037491798401, 0.47107874963548446, 0.4624874030960931, 0.4566742613103655, 0.45044924352963767, 0.4381997140566508, 0.4378297878000471, 0.42683829284773933, 0.42299784659279716, 0.41285812057918975], "acc": [0.2078, 0.3214666666666667, 0.38437777777777776, 0.42944444444444446, 0.4764888888888889, 0.5136444444444445, 0.5442444444444444, 0.5754, 0.6009111111111111, 0.6238888888888889, 0.6435555555555555, 0.6570222222222222, 0.6748222222222222, 0.6856222222222222, 0.7024444444444444, 0.7092222222222222, 0.7243777777777778, 0.7294222222222222, 0.7391111111111112, 0.7457777777777778, 0.7542, 0.7598888888888888, 0.7690666666666667, 0.7741555555555556, 0.7779555555555555, 0.7869111111111111, 0.7889555555555555, 0.7960222222222222, 0.7978444444444445, 0.8061555555555555, 0.8066444444444445, 0.8118222222222222, 0.8170666666666667, 0.8140666666666667, 0.8214888888888889, 0.8253111111111111, 0.8269777777777778, 0.8326222222222223, 0.8339333333333333, 0.8393333333333334, 0.8418, 0.8445777777777778, 0.8465111111111111, 0.8454888888888888, 0.849, 0.8518888888888889, 0.8519111111111111, 0.8569333333333333, 0.858, 0.8608666666666667]}, "conf": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "test_eval_scores": [0.5524019843101502, 0.8191], "predicted": [[0.0003143296926282346, 4.398150122142397e-05, 0.0022878870368003845, 0.8889051079750061, 0.0017504013376310468, 0.1023530438542366, 0.0031481210608035326, 0.0008017173386178911, 0.00029764039209112525, 9.779969695955515e-05], [0.0005420331726782024, 0.00224213395267725, 2.4169698008336127e-05, 8.35457249195315e-05, 6.503771601273911e-06, 0.0002486334997229278, 4.174287369096419e-06, 3.5665318137034774e-05, 0.9965834021568298, 0.0002297607425134629], [0.08696670085191727, 0.5836418271064758, 0.0022724736481904984, 0.0031527355313301086, 0.0008830752922222018, 0.001316503738053143, 0.001376124913804233, 0.0006017222185619175, 0.3056478202342987, 0.01414103340357542], [0.9653600454330444, 0.0009628159459680319, 0.013466795906424522, 0.0077065094374120235, 0.000646159634925425, 0.001609570812433958, 5.507971945917234e-05, 0.0003070184320677072, 0.009091882035136223, 0.0007940254872664809], [8.545272430637851e-05, 0.0002927463501691818, 0.012954997830092907, 0.03585522994399071, 0.022650979459285736, 0.0010793798137456179, 0.9267318248748779, 8.824267570162192e-05, 0.00010703188308980316, 0.00015406477905344218], [0.00037684873677790165, 0.00012938244617544115, 0.005939993541687727, 0.047682952135801315, 0.006700693164020777, 0.012743846513330936, 0.9257938861846924, 0.0005166199989616871, 4.799332600669004e-05, 6.777199450880289e-05], [0.0017897546058520675, 0.8896306157112122, 0.001340928254649043, 0.010770614258944988, 0.0006944431224837899, 0.005253470037132502, 0.0011626345803961158, 0.0004023303044959903, 0.0014182055601850152, 0.08753707259893417], [0.007270404603332281, 0.0001950947189470753, 0.14044150710105896, 0.15610596537590027, 0.4640110433101654, 0.015047297812998295, 0.2136060744524002, 0.0008180312579497695, 0.001941837021149695, 0.0005626374040730298], [0.0001526469422969967, 1.3485615454555955e-05, 0.00382746709510684, 0.888542890548706, 0.008434002287685871, 0.09560279548168182, 0.0009164876537397504, 0.0021781239192932844, 0.0002622353786136955, 6.986174412304536e-05], [0.000511200341861695, 0.9617146253585815, 0.0002113943628501147, 0.0005485202418640256, 0.00032497465144842863, 0.0005885451100766659, 0.0005154569516889751, 6.660547660430893e-05, 0.026565732434391975, 0.008952944539487362], [0.7157093286514282, 0.00012319732923060656, 0.025710754096508026, 0.2182876020669937, 0.004747486207634211, 0.02916710451245308, 0.0013595374766737223, 0.001614394597709179, 0.0030082210432738066, 0.00027241051429882646], [7.333022495004116e-06, 0.00040023389738053083, 6.747026782250032e-05, 7.504381210310385e-05, 6.083032349124551e-05, 4.321442247601226e-05, 4.3055468267994e-05, 1.1822212400147691e-05, 4.8281890485668555e-06, 0.9992861151695251], [0.0002635720302350819, 0.00011576853285077959, 0.005692420061677694, 0.2608277499675751, 0.06551996618509293, 0.6428317427635193, 0.006621904671192169, 0.017989713698625565, 5.77922874072101e-05, 7.934686436783522e-05], [4.0365663153352216e-05, 2.9659870051546022e-05, 0.0013964649988338351, 0.00661467807367444, 0.004514816217124462, 0.03668878600001335, 9.82911660685204e-05, 0.9505163431167603, 1.7280199244851246e-05, 8.337751205544919e-05], [9.525738278171048e-05, 0.01615867204964161, 0.0001348055520793423, 0.0003776385565288365, 0.00016859776224009693, 0.00019371275266166776, 5.3425319492816925e-05, 3.652948362287134e-05, 0.00027218175819143653, 0.9825091361999512], [0.001160615822300315, 0.00018832198111340404, 0.0009603861253708601, 0.0033637802116572857, 0.00029194788658060133, 0.00044142804108560085, 0.0021073368843644857, 3.6393579648574814e-05, 0.9909232258796692, 0.0005265599465928972], [0.0002521880087442696, 8.83176107890904e-05, 0.0010015354491770267, 0.07082463800907135, 0.0004346989735495299, 0.9253568649291992, 0.00022902975615579635, 0.0014058186206966639, 0.0003521043108776212, 5.4863856348674744e-05], [0.001955545274540782, 0.00018134583660867065, 0.021899763494729996, 0.20202253758907318, 0.08616912364959717, 0.062383342534303665, 0.005151445511728525, 0.615023136138916, 0.0005507434252649546, 0.004663070663809776], [7.463778456440195e-05, 5.8847836044151336e-05, 2.6392550353193656e-05, 6.949288217583671e-05, 9.241756742994767e-06, 9.4938775873743e-05, 9.746516298037022e-06, 5.594381036644336e-06, 0.9995635151863098, 8.757353498367593e-05], [1.3396062968240585e-05, 4.225842349114828e-05, 0.0016949642449617386, 0.0012748977169394493, 0.0011058059753850102, 8.295920270029455e-05, 0.9957365989685059, 1.1523255125212017e-05, 1.4082172128837556e-05, 2.346747714909725e-05], [0.0022593324538320303, 0.0026215598918497562, 0.0017911811592057347, 0.18516185879707336, 0.02677946723997593, 0.5362568497657776, 0.0007976372726261616, 0.24055834114551544, 0.00020581109856721014, 0.0035678877029567957], [0.926888644695282, 6.848919292679057e-05, 0.06508937478065491, 0.005205526016652584, 0.0007087435224093497, 0.0010306573240086436, 0.0002403620455879718, 0.00020640545699279755, 0.0005163910100236535, 4.543818431557156e-05], [0.06589176505804062, 4.3297113734297454e-05, 0.09304462373256683, 0.11205973476171494, 0.712506890296936, 0.004416600335389376, 0.006910817231982946, 0.0003562347264960408, 0.004757176619023085, 1.2827257705794182e-05], [2.697577110666316e-05, 0.0032497160136699677, 5.9478465118445456e-05, 9.906060586217791e-05, 0.00012193405564175919, 5.716329178540036e-05, 2.6033427275251597e-05, 1.6546813640161417e-05, 1.1497122613945976e-05, 0.9963316321372986], [0.0001749935036059469, 4.725275630335091e-06, 0.0011692699044942856, 0.009634314104914665, 0.9766076803207397, 0.010631854645907879, 0.00021750586165580899, 0.00153524917550385, 1.1623117643466685e-05, 1.283435631194152e-05], [0.009780392982065678, 0.00011715882283169776, 0.5085773468017578, 0.2744430899620056, 0.024012617766857147, 0.02487076260149479, 0.14295154809951782, 0.005049805622547865, 0.008785258047282696, 0.0014120162231847644], [0.0043131099082529545, 0.00019041425548493862, 0.2070918083190918, 0.06823299825191498, 0.6951723098754883, 0.01355677843093872, 0.007906656712293625, 0.0032530822791159153, 0.00015598176105413586, 0.00012689574214164168], [0.9846792817115784, 4.76244640594814e-05, 0.0074356840923428535, 0.002879571868106723, 0.002373297465965152, 0.0010033794678747654, 0.00019477857858873904, 0.0007510694558732212, 0.0003519152814988047, 0.0002833765756804496], [4.885408634436317e-05, 0.0005382615490816534, 0.00022056695888750255, 0.0004863145004492253, 0.00028550592833198607, 0.0001689017954049632, 0.00012229519779793918, 2.7744494218495674e-05, 9.330268221674487e-05, 0.9980083107948303], [0.00045821029925718904, 0.0001553597248857841, 0.0058997273445129395, 0.005769689101725817, 0.0032718328293412924, 0.0006253922474570572, 0.9834609031677246, 0.0001706699695205316, 5.1475115469656885e-05, 0.00013665204460266978], [0.007241853047162294, 0.0007891735294833779, 0.17130018770694733, 0.061306893825531006, 0.036135900765657425, 0.004870263859629631, 0.7155756950378418, 0.0009621562203392386, 0.0006508949445560575, 0.0011669631348922849], [0.00013156543718650937, 3.452509190537967e-05, 0.002007253235206008, 0.08319535851478577, 0.0009923455072566867, 0.9115411639213562, 0.001582935219630599, 0.0004493669548537582, 5.1177601562812924e-05, 1.4191084119374864e-05], [0.00811233464628458, 0.00032922200625762343, 0.0781710296869278, 0.04641948267817497, 0.8119486570358276, 0.005626027472317219, 0.011340100318193436, 0.00391797861084342, 0.03125137463212013, 0.002883769338950515], [0.000752958410885185, 0.0020645104814320803, 0.05923956632614136, 0.206009179353714, 0.015829090029001236, 0.6659645438194275, 0.03776637464761734, 0.00879330188035965, 0.002400993602350354, 0.0011794611345976591], [0.0008207447244785726, 0.00040945547516457736, 0.00024342865799553692, 0.0003712831239681691, 0.0002751631836872548, 0.00010238905815640464, 5.942003190284595e-05, 0.00012177278404124081, 0.0003718174702953547, 0.9972245693206787], [0.0017814335878938437, 0.012880882248282433, 0.015207554213702679, 0.41350898146629333, 0.0021232175640761852, 0.17793694138526917, 0.026214847341179848, 0.0018716470804065466, 0.3426867723464966, 0.0057877302169799805], [7.524441025452688e-05, 9.924223149937461e-07, 0.0018519362201914191, 0.009791641496121883, 0.9394052624702454, 0.026907188817858696, 0.00031718789250589907, 0.021633870899677277, 9.053071153175551e-06, 7.696787179156672e-06], [0.0015280161751434207, 0.5384268164634705, 0.0012669729767367244, 0.008270573802292347, 0.0004536884371191263, 0.009261260740458965, 0.0009506584610790014, 0.001057336456142366, 0.03793564438819885, 0.40084901452064514], [0.00012424263695720583, 0.0017860910156741738, 0.00020329043036326766, 0.00027123582549393177, 0.0002949022746179253, 0.0001065491305780597, 0.00015555780555587262, 2.3258124201674946e-05, 0.0007039479096420109, 0.9963309168815613], [3.2541280233999714e-05, 0.00013627611042466015, 0.00033862009877339005, 0.017045972868800163, 0.0002754079469013959, 0.9814721345901489, 0.000238100576098077, 0.00041229091584682465, 3.515559001243673e-05, 1.3498722182703204e-05], [0.0233249980956316, 4.504989556153305e-05, 0.01429025549441576, 0.006903666537255049, 0.9518182873725891, 0.0015159588074311614, 0.0003423199232202023, 0.0008955035009421408, 0.0005133310332894325, 0.00035054876934736967], [0.0001148849114542827, 8.558774425182492e-05, 0.0019876533187925816, 0.00419272854924202, 0.0005343817174434662, 0.0002452194457873702, 0.9926877021789551, 2.8764539820258506e-05, 8.443742444796953e-06, 0.00011466053547337651], [0.002995055168867111, 0.00015720061492174864, 0.1759873330593109, 0.267850399017334, 0.01971983164548874, 0.13911683857440948, 0.004497585352510214, 0.38678547739982605, 0.001049885293468833, 0.0018404205329716206], [0.00011565523891476914, 0.00011494972568470985, 0.002284855116158724, 0.002811351092532277, 0.0005482823471538723, 0.0002065934386337176, 0.9935802221298218, 2.197093090217095e-05, 0.0002335843164473772, 8.265198994195089e-05], [0.99527907371521, 5.953587606200017e-05, 0.0003598616167437285, 0.0003728249575942755, 3.629019920481369e-05, 0.00010108375863637775, 1.018946363728901e-06, 9.146581578534096e-05, 0.003041050396859646, 0.0006579032051376998], [9.099694580072537e-05, 0.0005424354458227754, 5.481915650307201e-05, 6.350612238747999e-05, 7.181665569078177e-05, 4.3597279727691785e-05, 7.373659627774032e-06, 3.7788744521094486e-05, 0.00025893712881952524, 0.9988287091255188], [8.710083784535527e-05, 1.8919206922873855e-05, 0.011554437689483166, 0.8430382013320923, 0.04387006536126137, 0.07235922664403915, 0.026393195614218712, 0.002508641919121146, 0.00011647769861156121, 5.365625838749111e-05], [0.014410613104701042, 0.06227215379476547, 0.026684120297431946, 0.04798034578561783, 0.0175939854234457, 0.010287918150424957, 0.0070810941979289055, 0.0026229838840663433, 0.22998477518558502, 0.5810821056365967], [2.4526798370061442e-06, 7.016250265223789e-07, 0.00010608012235024944, 0.00020567777391988784, 0.03570932894945145, 0.006322019267827272, 7.985133265719924e-07, 0.9576497673988342, 1.0248215858155163e-06, 2.167002094211057e-06], [0.002878344850614667, 0.0004692644870374352, 0.23751626908779144, 0.12856601178646088, 0.12340152263641357, 0.009214933961629868, 0.4922983944416046, 0.0010570103768259287, 0.004303411114960909, 0.0002949511108454317], [0.019209079444408417, 0.0015536071732640266, 0.0012759993551298976, 0.0016660302644595504, 0.0009798650862649083, 0.0001477832265663892, 0.0004079990030732006, 9.674795001046732e-05, 0.0049303146079182625, 0.9697326421737671], [0.0033825531136244535, 0.00011912741319974884, 0.0013790782541036606, 0.0016901936614885926, 0.002124897437170148, 0.0002481079427525401, 8.626290218671784e-05, 8.376849291380495e-05, 0.9905402660369873, 0.0003457418642938137], [0.06670951098203659, 0.0004541661182884127, 0.03860526531934738, 0.12052138894796371, 0.007120214868336916, 0.047605711966753006, 0.0016418559243902564, 0.7031996250152588, 0.002069181064143777, 0.01207320298999548], [0.00033786363201215863, 1.6416272046626545e-05, 0.04052521660923958, 0.7939956188201904, 0.017184603959321976, 0.1386411488056183, 0.0020956515800207853, 0.006476028822362423, 0.0006365911685861647, 9.09032896743156e-05], [0.00861435104161501, 4.2941555875586346e-05, 0.0012399295810610056, 0.0016401429893448949, 0.000382869882741943, 0.00012241335934959352, 1.0166465472138952e-05, 1.5797360902070068e-05, 0.987483024597168, 0.0004484066157601774], [0.017207304015755653, 8.848127786009741e-10, 0.29306378960609436, 0.6068772673606873, 0.05996564403176308, 0.0024757743813097477, 8.245055482802854e-07, 1.1653851288428996e-05, 0.020397799089550972, 1.094479396002157e-09], [0.0004225033917464316, 2.814558320096694e-05, 0.007197447121143341, 0.11712205410003662, 0.3072259724140167, 0.17330998182296753, 0.0005364291719160974, 0.3932938575744629, 0.00039378643850795925, 0.00046985980588942766], [0.0005678551970049739, 0.0004457486793398857, 0.005338486284017563, 0.315606951713562, 0.005605658516287804, 0.6558223962783813, 0.0060595921240746975, 0.009643173776566982, 0.0006052288808859885, 0.00030488334596157074], [0.004552592057734728, 4.008840915048495e-05, 0.04916052520275116, 0.6555501222610474, 0.053959377110004425, 0.18604712188243866, 0.0049824765883386135, 0.044570453464984894, 0.0007277234108187258, 0.00040955274016596377], [0.00868234783411026, 0.0008347593247890472, 0.030143342912197113, 0.5875958800315857, 0.1108645349740982, 0.1302497535943985, 0.12883353233337402, 0.002137152012437582, 0.0004925764515064657, 0.0001661442220211029], [1.6982741726678796e-05, 2.644903815962607e-06, 8.474188507534564e-05, 0.00017983450379688293, 0.008620433509349823, 0.0037773707881569862, 7.320787176468002e-07, 0.9873064756393433, 2.852729949154309e-06, 7.996040949365124e-06], [3.4182125091319904e-05, 7.126483978936449e-05, 0.00826864130795002, 0.05989612266421318, 0.0016659378306940198, 0.9216289520263672, 0.00681393314152956, 0.001491262810304761, 5.227503788773902e-05, 7.753021782264113e-05], [0.002031943527981639, 0.000555213016923517, 0.01306978054344654, 0.04832242801785469, 0.004064766690135002, 0.0071210311725735664, 0.9232444167137146, 0.00047387616359628737, 0.00017786632815841585, 0.0009386489982716739], [0.0017005387926474214, 8.960862760432065e-05, 0.006392065901309252, 0.8960086703300476, 0.00563563359901309, 0.08243592083454132, 0.003622121876105666, 0.0028416619170457125, 0.0007970287697389722, 0.000476666638860479], [0.00019297677499707788, 9.08162328414619e-05, 0.0073468927294015884, 0.0169169120490551, 0.004200439900159836, 0.002877483842894435, 0.968087375164032, 0.00013551066513173282, 4.360366438049823e-05, 0.00010808067600009963], [0.00023068016162142158, 1.5203750990622211e-05, 0.9744483828544617, 0.010916000232100487, 0.006699022836983204, 0.0009366030571982265, 0.005564452148973942, 0.0010920836357399821, 7.58751921239309e-05, 2.1754140107077546e-05], [0.00019732644432224333, 0.9928029179573059, 0.0002046287409029901, 0.0003549458342604339, 0.00030578640871681273, 0.0004638811224140227, 0.000881794432643801, 2.6950387109536678e-05, 0.003001008415594697, 0.0017607042100280523], [0.0019096643663942814, 2.918607151514152e-06, 0.995559811592102, 0.0007131638703867793, 0.00044107306166552007, 0.0006680859951302409, 0.0005781927611678839, 5.4876829381100833e-05, 7.132049358915538e-05, 9.952947266356205e-07], [0.00010692353680497035, 4.765554695040919e-05, 0.010924054309725761, 0.9020282030105591, 0.01869269646704197, 0.057074371725320816, 0.008265994489192963, 0.0021666022948920727, 0.0005632952088490129, 0.00013002997729927301], [0.005933711770921946, 0.00029724021442234516, 0.011934715323150158, 0.0371822752058506, 0.04379987344145775, 0.023305203765630722, 0.0002243148919660598, 0.8702774047851562, 0.0011760626221075654, 0.005869265180081129], [0.09464061260223389, 0.0005957433604635298, 0.20355336368083954, 0.15284687280654907, 0.003989258781075478, 0.02583208866417408, 0.06308461725711823, 0.0006969194510020316, 0.45399898290634155, 0.0007615355425514281], [0.00018659002671483904, 0.001263836515136063, 0.008523780852556229, 0.18358764052391052, 0.008456308394670486, 0.02690345048904419, 0.7699100971221924, 0.00044646154856309295, 6.394390220521018e-05, 0.0006579529144801199], [0.006576202809810638, 0.0001257309631910175, 0.0008759427582845092, 0.0037259780801832676, 0.0001916670735226944, 0.0010641750413924456, 0.00014876099885441363, 0.00011537016689544544, 0.9869518280029297, 0.0002244087227154523], [0.008739178068935871, 0.000567034468986094, 0.0009100198512896895, 0.0032715643756091595, 0.00020132538338657469, 0.0006117921438999474, 0.00019874262216035277, 6.708411820000038e-05, 0.9842303395271301, 0.0012028878554701805], [0.6748339533805847, 0.05400848761200905, 0.0013775613624602556, 0.003987307194620371, 0.0008013311889953911, 0.0003310109896119684, 0.000884579261764884, 0.000365438376320526, 0.019358906894922256, 0.24405142664909363], [3.653799285530113e-05, 3.246853168548114e-07, 0.993812084197998, 0.0014492508489638567, 0.0006166386301629245, 0.0035472179297357798, 0.0003962698392570019, 0.00012394439545460045, 1.7411655790056102e-05, 3.8072130337241106e-07], [0.9100399613380432, 0.0010659582912921906, 0.002919837599620223, 0.0012129386886954308, 0.0022914810106158257, 0.0001984841946978122, 2.3892389435786754e-05, 0.0021474298555403948, 0.0021926008630543947, 0.07790743559598923], [5.0151760660810396e-05, 4.148565494688228e-05, 0.0016487556276842952, 0.9739639163017273, 0.0024919540155678988, 0.018635466694831848, 0.002282476518303156, 0.000463244243292138, 0.0003334371140226722, 8.917509694583714e-05], [0.00035455040051601827, 0.00012802580022253096, 0.004260544665157795, 0.10868348181247711, 0.0019893464632332325, 0.8760243654251099, 0.0010302022565156221, 0.007214795332401991, 0.00019047848763875663, 0.00012416666140779853], [0.0004729052889160812, 3.279927113908343e-05, 0.0002557840780355036, 0.000507286807987839, 5.945958400843665e-05, 0.0003695765626616776, 5.7813729654299095e-05, 3.3154294214909896e-05, 0.9981757402420044, 3.5475968616083264e-05], [0.0013439278118312359, 0.0002274576690979302, 0.00023955522920005023, 0.00034448460792191327, 7.87568133091554e-05, 0.0002482257841620594, 8.090607298072428e-05, 3.420660141273402e-05, 0.9973033666610718, 9.914011025102809e-05], [0.03954271227121353, 0.8920789957046509, 0.0011354968883097172, 0.002043195767328143, 0.0008624934125691652, 0.0007914291345514357, 0.0003065233468078077, 0.0012973736738786101, 0.0012674573808908463, 0.060674309730529785], [0.00013067713007330894, 0.9986957907676697, 0.00011065121361752972, 8.22793590486981e-05, 0.0002198187867179513, 7.8530989412684e-05, 0.00032129514147527516, 8.659808372613043e-06, 0.0002665368374437094, 8.575557876611128e-05], [0.0014975473750382662, 2.94669225695543e-05, 0.005739158485084772, 0.01603417843580246, 0.025346798822283745, 0.05208464711904526, 3.871758235618472e-05, 0.8988829255104065, 0.00019165323465131223, 0.00015496090054512024], [0.0007385562639683485, 3.6170915791444713e-06, 0.9869962930679321, 0.002872339216992259, 0.0009997911984100938, 0.006780963856726885, 0.0013059984194114804, 0.00023139895347412676, 6.834669329691678e-05, 2.6902948775386903e-06], [0.0017123199068009853, 5.31610130565241e-05, 0.4713917076587677, 0.06598860025405884, 0.0065399520099163055, 0.4391116499900818, 0.0031110874842852354, 0.011692976579070091, 0.0002375105832470581, 0.000161037765792571], [0.017610857263207436, 8.506175072398037e-05, 0.6505773067474365, 0.24199652671813965, 0.03551793470978737, 0.030791671946644783, 0.0055809663608670235, 0.01621411368250847, 0.0015166435623541474, 0.00010896936146309599], [0.007145237177610397, 3.452745659160428e-05, 0.289143443107605, 0.5226473212242126, 0.04723228141665459, 0.02710414119064808, 0.010062666609883308, 0.02292538248002529, 0.07061430811882019, 0.003090660087764263], [0.0004118205397389829, 0.00028560790815390646, 0.00023332588898483664, 0.0006688909488730133, 7.301676669158041e-05, 0.000440878386143595, 5.750127456849441e-05, 3.3096592233050615e-05, 0.9962617754936218, 0.0015340868849307299], [0.00024403599672950804, 0.008388794958591461, 0.0002536556567065418, 0.00022626016288995743, 0.000347148539731279, 7.68064710428007e-05, 0.00025567703414708376, 3.0368179068318568e-05, 0.0005774235469289124, 0.9895998239517212], [0.9981387853622437, 1.179505397885805e-05, 0.0007251357310451567, 0.00017806068353820592, 6.428741471609101e-05, 5.941050767432898e-05, 1.5774551229696954e-06, 7.387984078377485e-05, 0.0006479387520812452, 9.904730541165918e-05], [0.00013936171308159828, 0.00024258707708213478, 0.02214912511408329, 0.7467653155326843, 0.023463521152734756, 0.12112012505531311, 0.08389034122228622, 0.0016897968016564846, 0.00029341576737351716, 0.0002463318523950875], [0.001184085849672556, 0.00012546956713777035, 0.00020860412041656673, 0.0006705179694108665, 8.134863310260698e-05, 0.0003237796190660447, 4.896058453596197e-05, 2.9533839551731944e-05, 0.9971741437911987, 0.00015360878023784608], [6.20434366283007e-05, 4.122819154872559e-05, 0.0013156784698367119, 0.002931473543867469, 0.0003621659707278013, 0.00013563894026447088, 0.9950404763221741, 1.4091463526710868e-05, 2.1568235752056353e-05, 7.559572259197012e-05], [0.0005671465187333524, 9.250667972082738e-06, 0.005640450399369001, 0.018788769841194153, 0.9384618997573853, 0.019494712352752686, 0.000304886867525056, 0.0166239682585001, 8.162311860360205e-05, 2.7261405193712562e-05], [9.560645412420854e-05, 2.0939793103025295e-05, 0.0061133126728236675, 0.08458050340414047, 0.02248227223753929, 0.0025237626396119595, 0.8831062912940979, 0.0003517887962516397, 0.00045162002788856626, 0.0002738407056313008], [0.0025473730638623238, 0.0004663488070946187, 0.012776721268892288, 0.0100344093516469, 0.036406196653842926, 0.000839544809423387, 0.9362910389900208, 8.768746920395643e-05, 0.0003036285925190896, 0.00024695004685781896], [0.5126861333847046, 1.91381750482833e-05, 0.24173355102539062, 0.21099966764450073, 0.008439799770712852, 0.013942128047347069, 0.010212326422333717, 0.0006485598860308528, 0.0012965960195288062, 2.2134121536510065e-05], [0.980885922908783, 2.1327101421775296e-05, 0.015541959553956985, 0.001599593786522746, 0.0010633376659825444, 0.0004553633916657418, 8.254469139501452e-05, 0.00016894479631446302, 0.0001384041242999956, 4.2618685256456956e-05], [0.00351929129101336, 0.00010766628111014143, 0.398064523935318, 0.3438009023666382, 0.03742337226867676, 0.14103345572948456, 0.03151462599635124, 0.04268230125308037, 0.0010786097263917327, 0.0007753229001536965], [0.00015254458412528038, 1.012269603961613e-05, 0.02135525271296501, 0.01759939454495907, 0.9201122522354126, 0.01702924631536007, 0.0030108997598290443, 0.020530397072434425, 9.117275476455688e-05, 0.00010869750258279964], [3.3102947782026604e-05, 2.4770748495939188e-05, 0.002013406017795205, 0.08992520719766617, 0.0038517022039741278, 0.899778425693512, 0.0008063834393396974, 0.0034673702903091908, 8.256931323558092e-05, 1.7050844689947553e-05], [0.0011905484134331346, 0.0005010529421269894, 0.029749536886811256, 0.17819824814796448, 0.0023444180842489004, 0.028114672750234604, 0.7510710954666138, 0.006856135558336973, 0.00019918367615900934, 0.0017751100240275264], [1.3220062101026997e-05, 3.0263404369179625e-06, 0.012015562504529953, 0.9177111983299255, 0.015282785519957542, 0.023274848237633705, 0.030133908614516258, 0.0013589108129963279, 0.00015618623001500964, 5.029697058489546e-05], [9.998953464673832e-05, 0.9992977380752563, 4.13254092563875e-05, 3.932003164663911e-05, 0.00018922399613074958, 6.41544975223951e-05, 1.7068858142010868e-05, 4.8461693950230256e-05, 4.241800706950016e-05, 0.00016032559506129473], [0.0003037084243260324, 0.9979280233383179, 0.00018137559527531266, 0.0003848846536129713, 9.170234261546284e-05, 0.00028175610350444913, 0.00021770074090454727, 3.729844684130512e-05, 0.00028273853240534663, 0.0002907368470914662], [0.037997107952833176, 0.0039903842844069, 0.24636107683181763, 0.4723520576953888, 0.006921203341335058, 0.09672943502664566, 0.12383828312158585, 0.003561417106539011, 0.0070992340333759785, 0.0011499288957566023], [0.00014876291970722377, 4.577654181048274e-05, 0.01216723583638668, 0.01573791727423668, 0.014685477130115032, 0.0009028341737575829, 0.955604076385498, 0.0002763750380836427, 0.00014405690308194607, 0.00028760661371052265], [0.0030022459104657173, 0.008548485115170479, 0.00020414305618032813, 0.000606716494075954, 7.71198610891588e-05, 0.0009286795393563807, 4.4466156396083534e-05, 0.00023228625650517642, 0.9838237762451172, 0.002532076323404908], [0.0005678372690454125, 3.4599997889017686e-05, 0.0019993085879832506, 0.007869746536016464, 0.00081541488179937, 0.014928956516087055, 4.163835910730995e-05, 0.9727789759635925, 0.00019999626965727657, 0.000763533404096961], [5.41460576641839e-05, 6.445318376790965e-06, 0.0076636653393507, 0.03086058236658573, 0.899724543094635, 0.053004391491413116, 0.002771059749647975, 0.00587100675329566, 3.37769643010688e-06, 4.071410876349546e-05], [0.9524109363555908, 0.0020273944828659296, 0.020425666123628616, 0.004114403389394283, 0.0008538825204595923, 0.0008489813772030175, 7.067207479849458e-05, 0.0004178479721304029, 0.016238706186413765, 0.0025915110018104315], [0.21864445507526398, 0.07001368701457977, 0.28887632489204407, 0.0417088121175766, 0.003200290724635124, 0.004973146598786116, 0.25849980115890503, 0.0008568264893256128, 0.10241043567657471, 0.010816230438649654], [7.59545000619255e-05, 9.401695137967181e-07, 0.9729276895523071, 0.009992551989853382, 0.006689595058560371, 0.005975387524813414, 0.004047740250825882, 0.00023144244914874434, 5.4837622883496806e-05, 3.814952378888847e-06], [0.0007430966361425817, 0.9965654015541077, 0.00012298452202230692, 0.00024821513216011226, 7.642716082045808e-05, 0.00021288807329256088, 4.428232932696119e-05, 1.5175087355601136e-05, 0.00037338334368541837, 0.0015981405740603805], [0.0013451508712023497, 0.00033329526195302606, 0.014624344184994698, 0.832116961479187, 0.006688954774290323, 0.13408641517162323, 0.0039031493943184614, 0.00519074872136116, 0.0007132251630537212, 0.0009977021254599094], [0.8996508121490479, 6.1818022913939785e-06, 0.08992708474397659, 0.002809579484164715, 0.0028940928168594837, 0.0008389062713831663, 8.258036541519687e-05, 0.0003532088885549456, 0.0034280866384506226, 9.35857678996399e-06], [0.018409835174679756, 0.00015883058949839324, 0.018919600173830986, 0.03225093334913254, 0.9098729491233826, 0.012668829411268234, 0.00142865686211735, 0.005818448029458523, 0.00032451286097057164, 0.00014738849131390452], [0.00021937183919362724, 4.256819738657214e-05, 0.17631228268146515, 0.7251806855201721, 0.021729739382863045, 0.04877156391739845, 0.023758387193083763, 0.0027460437268018723, 